source/20231128T130210--printing-with-cups-in-ubuntu__linux.org
#+title:      printing with cups in ubuntu
#+date:       [2023-11-28 Tue 13:02]
#+filetags:   :linux:
#+identifier: 20231128T130210

video explaining - https://www.youtube.com/watch?v=En2DJAMpwmY

- sudo apt install cups
- sudo systemctl enable cups
- sudo systemctl start cups
- sudo systemctl status cups
- download drivers from [[https://support.hp.com/lt-en/drivers/selfservice/samsung-xpress-sl-m2022-laser-printer-series/17157279/model/17157283][here]]
- sudo tar -xvzf udl bla folderi ta draiverio
- sudo ./install.sh
- login to cups service - http://localhost:631/
- add printer, pasirenki samsung m2020 series
- draiveriai turetu automatiskai buti parinkti teisingi samsung m2020
  series (en)
- add printer
- spausdink i sveikata
