html/20231128T130210--printing-with-cups-in-ubuntu__linux.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/devnotes/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/devnotes/html">
<title>printing with cups in ubuntu</title>
<meta name="author" content="Arvydas Gasparavicius">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
<link rel="stylesheet" href="../static/style.css"/>
<link rel="icon" href="../static/ag.ico">
</head>
<body>
<div id="preamble" class="status"><br>preamble here yo</br></div>
<div id="content">
<div class="post-date">15 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/devnotes/html/20231128T130210--printing-with-cups-in-ubuntu__linux.html">printing with cups in ubuntu</a></h1>
<p>
video explaining - <a href="https://www.youtube.com/watch?v=En2DJAMpwmY">https://www.youtube.com/watch?v=En2DJAMpwmY</a>
</p>

<ul class="org-ul">
<li>sudo apt install cups</li>
<li>sudo systemctl enable cups</li>
<li>sudo systemctl start cups</li>
<li>sudo systemctl status cups</li>
<li>download drivers from <a href="https://support.hp.com/lt-en/drivers/selfservice/samsung-xpress-sl-m2022-laser-printer-series/17157279/model/17157283">here</a></li>
<li>sudo tar -xvzf udl bla folderi ta draiverio</li>
<li>sudo ./install.sh</li>
<li>login to cups service - <a href="http://localhost:631/">http://localhost:631/</a></li>
<li>add printer, pasirenki samsung m2020 series</li>
<li>draiveriai turetu automatiskai buti parinkti teisingi samsung m2020
series (en)</li>
<li>add printer</li>
<li>spausdink i sveikata</li>
</ul>
<div class="taglist"><a href="https://arvydasg.github.io/devnotes/html/tags.html">Tags</a>: <a href="https://arvydasg.github.io/devnotes/html/tag-linux.html">linux</a> </div></div>
<div id="postamble" class="status"><br>postamble in he house</br></div>
</body>
</html>
